{
  "message": "feat: DEV-4081: Implements Magic Wand tool for image segmentation (#1119)\n\n* Rename floodfill tools to magic wand in preparation of work.\r\n\r\n* Implements image segmentation Magic Wand.\r\n\r\nThis PR implements a Magic Wand, making it possible to click in a region of an image a user is doing segmentation labeling on, drag the mouse to dynamically change flood filling tolerance, then release the mouse button to get a new labeled area. It is particularly effective at labeling broad, diffuse, complex edged objects, such as clouds, cloud shadows, snow, etc. in earth observation applications or organic shapes in biomedical applications.\r\n\r\nIn-depth technical overview on how it works at the top of src/tools/MagicWand.js.\r\n\r\n* Collapse multiple Magic Wand additions into the same class if appropriate.\r\n\r\n* Remove console statement.\r\n\r\n* Stack classes from successive Magic Wand thresholds when we are able to.\r\n\r\n* Be able to collapse wand regions even if panning has happened.\r\n\r\n* Remove spurious comments.\r\n\r\n* Remove spurious console statement.\r\n\r\n* Fix doc issue.\r\n\r\n* Fix code line that got hidden by comment somehow.\r\n\r\n* Double to single quotes to match new code style.\r\n\r\n* Change protocol and storage bucket for Magic Wand example.\r\n\r\nThe old bucket was configured under the wrong project, and using https instead of http causes mixed content issues for CORS. Local development is done with http so using that.\r\n\r\n* Whitespace fix.\r\n\r\n* Capture undo/redoes and invalidate offscreen cache.\r\n\r\nThis means undo/redo will now work correctly, but will end up creating a new class layer if more magic wanding is done on the current instance.\r\n\r\n* Put Magic Wand behind a feature flag (fflag_feat_front_dev_4081_magic_wand_tool).\r\n\r\n* Fix path for feature flag file.\r\n\r\n* Make the crossOrigin attribute more granular and flexible for different deployment scenarios.\r\n\r\n* Remove listing the magic wand feature flag here.\r\n\r\n* Magic Wand will be on in front end by default, but the server config will have it off by default.\r\n\r\nNote that this is needed so that Magic Wand e2e integration tests will work.\r\n\r\n* Whitespace fix.\r\n\r\n* e2e integration tests for the Magic Wand.\r\n\r\n* Lint fix -- remove unused import.\r\n\r\n* Doc fix.\r\n\r\n* Bring Brush tag in when Magicwand tag used, to deal with Eraser tool getting duplicated.\r\n\r\n* Make sure the eraser shows up when just magicwand tag present.\r\n\r\nTo do this, we have to ensure that the eraser doesn't get added twice if the brush tag is also present.\r\n\r\n* Make sure magicwand drafts are properly saved for autosave.\r\n\r\n* Enable eraser integration tests now that this bug is fixed.\r\n\r\n* Put duplicate tools panel logic behind magicwand feature flag as well.\r\n\r\n* Fix incorrect import path.\r\n\r\n* Make Magic Wand feature flag more dynamic, and tie into it for e2e teste.\r\n\r\n* Code review feedback.\r\n\r\n* Follow standard `node scripts/create-docs.js` flow.\r\n\r\nNote that we have not been able to make sure the docs are generated correctly until the https://api.github.com/repos/heartexlabs/label-studio/contents/docs/source/tags API endpoint registers the magicwand tag.\r\n\r\n* Fix docs so they are autogenerated correctly.\r\n\r\n* Make code review feedback changes.\r\n\r\n* Have the Brush be shown in the Magic Wand example as well.\r\n\r\n* Lint and compilation fixes.\r\n\r\n* Make Magic Wand thresholding more robust with better UX.\r\n\r\nBasically, we now calculate the Magic Wand thresholding from the entire screen, not just relative to the image. We also correctly allow you to drag in any direction to get positive or negative thresholding.\r\n\r\n* Ensure currently selected region still works when changing between some tools.\r\n\r\nThe Magic Wand, the Brush, and the Eraser should all retain selection when moving between them, as well as when moving between those tools and the Zoom or Pan tools.\r\n\r\nThis fix allows removing some hacky specific code I added for the Magic Wand for this behavior.\r\n\r\nFixes https://github.com/heartexlabs/label-studio/issues/3510.\r\n\r\n* Removed unused imports.\r\n\r\n* Change path to Heartex AWS buckets.\r\n\r\n* Make changes based on code review feedback.\r\n\r\n* Add feature flags around unselect behavior.\r\n\r\n* Fix region unselection for Selection, Erase & others\r\n\r\nErase previously had false, so it should not unselect region in any case.\r\nTools like Selection, Zoom and others should not unselect it as well.\r\nSo set default to false and added true to DrawingTool mixin.\r\n\r\n* Temporarily disable gallery in e2e because of CORS\r\n\r\nCurrently tests are failing when image in gallery is switched.\r\nThese CORS errors can be fixed in separate PR, so had to disable it.\r\n\r\n---------\r\n\r\nCo-authored-by: Brad Neuberg <bradneuberg@planet.com>\r\nCo-authored-by: Sergey Zhuk <sergey.zhuk@heartex.com>\r\nCo-authored-by: hlomzik <hlomzik@gmail.com>\r\nCo-authored-by: Nikita Belonogov <nikita.belonogov@heartex.com>",
  "commit": "18fc2e52136e5c2652dadb2659f44ef7625c8459",
  "branch": "master",
  "date": "2023-02-13T15:56:46Z"
}